Repository: spf13/cobra
Catalog: locales/default/*.po
Languages: fr

# CommandDeprecatedWarning
source: Command %q is deprecated, %s
fr: La commande %q est dépréciée, %s

# CommandHelpLong
source: Help provides help for any command in the application. Simply type %s for full details.
fr: Help fournit de l'aide pour n'importe quelle commande de l'application. Tapez '%s' pour obtenir une aide détaillée.

# CommandHelpShort
source: Help about any command
fr: Obtenir de l'aide au sujet d'une commande

# CommandHelpUnknownTopicError
source: Unknown help topic %#q
fr: Sujet d'aide %#q inconnu

# CompletionCommandShellDirectiveTip
source: Completion ended with directive: %s
fr: Auto-complétion achevée par la directive : %s

# CompletionCommandShellLong
source: %s is a special command that is used by the shell completion logic to request completion choices for the specified command-line.
fr: %s est une commande spéciale utilisée par l'auto-complétion de la console pour récupérer les différents choix possibles pour une certaine commande.

# CompletionCommandShellShort
source: Request shell completion choices for the specified command-line
fr: Obtenir les différentes possibilités d'auto-complétion pour une certaine commande

# CompletionSubcommandNoDescFlagDesc
source: disable completion descriptions
fr: désactiver les desriptions

# CompletionSubcommandUnsupportedFlagError
source: subcommand '%s' does not support flag '%s'
fr: la sous-commande '%s' ne comprend pas l'option '%s'

source: Did you mean this?
fr: Vouliez-vous dire ceci ?

source: Error
fr: Erreur

# ExactArgsValidationError
source: accepts %d arg, received %d
fr: accepte %d arg, mais en a reçu %d

# ExclusiveFlagsValidationError
source: if any flags in the group [%v] are set none of the others can be; %v were all set
fr: les options [%v] sont exclusives, mais les options %v ont été fournies

# FlagNotSetError
source: required flag "%s" is not set
fr: l'option requise "%s" n'est pas présente

# ForInfoAboutCommand
source: for more information about a command
fr: pour plus d'information au sujet d'une commande

source: help for
fr: aide pour

# LegacyArgsValidationError
source: unknown command %q for %q%s
fr: commande %q inconnue pour %q%s

# MaximumNArgsValidationError
source: accepts at most %d arg, received %d
fr: accepte au plus %d arg, mais en a reçu %d

# MinimumNArgsValidationError
source: requires at least %d arg, only received %d
fr: requiert au moins %d arg, mais en a reçu %d

# NoArgsValidationError
source: unknown command %q for %q
fr: commande %q inconnue pour %q

# OnlyValidArgsValidationError
source: invalid argument %q for %q%s
fr: argument %q invalide pour %q%s

# RangeArgsValidationError
source: accepts between %d and %d arg, received %d
fr: accepte entre %d et %d arg, mais en a reçu %d

# RunHelpTip
source: Run '%v --help' for usage.
fr: Essayez '%v --help' pour obtenir de l'aide.

# SectionAdditionalCommands
source: Additional Commands
fr: Commandes Connexes

# SectionAdditionalHelpTopics
source: Additional Help Topics
fr: Autres Sujets

# SectionAliases
source: Aliases
fr: Alias

# SectionAvailableCommands
source: Available Commands
fr: Commandes Disponibles

# SectionExamples
source: Examples
fr: Exemples

# SectionFlags
source: Flags
fr: Options

# SectionGlobalFlags
source: Global Flags
fr: Options Globales

source: this command
fr: cette commande

source: Use
fr: Utiliser

source: version for
fr: version pour

source: command
fr: commande
